/*
 * GST.h
 *
 *  Created on: 2021/07/11
 *      Author: inakawa
 */

#ifndef C2A_AOCS_GST_H_
#define C2A_AOCS_GST_H_

// クラス宣言
//-----------------------------------------
class GST_CLASS
{
private:
    //-----------------------------------------
    // ADCS　計算関数宣言
    //-----------------------------------------

    // 実際にADCS系の計算を行う関数を宣言
    // 入出力は全て引数として定義（出力引数はポインタ渡し）

    float GST(double in_modified_julian_date);

    


public:
    //-----------------------------------------
    // 衛星ソフトウェア依存変数宣言
    //-----------------------------------------

    // 主には出力ベクトル、配列を宣言
    // float B_geodetic[3]; //[0]:B_north [1]:B_east [2]:B_down
	
    float gst_rad;


    //-----------------------------------------
    // 衛星ソフトウェア依存関数宣言
    //-----------------------------------------

    void GST_calc(double in_modified_julian_date);

};

#endif
