/*
 * SunVector.h
 *
 *  Created on: 2021/08/8
 *      Author: inakawa
 */

#ifndef C2A_AOCS_SUNVECTOR_H_
#define C2A_AOCS_SUNVECTOR_H_

#include <stdint.h> //for uint8_t
#include <src_core/System/TImeManager/time_manager.h>//for delay()


//-----------------------------------------
// クラス宣言
//-----------------------------------------
class SUNVECTOR_CLASS
{
private:
	//-----------------------------------------
	// ADCS　計算関数宣言
	//-----------------------------------------

	// 実際にADCS系の計算を行う関数を宣言
	// 入出力は全て引数として定義（出力引数はポインタ渡し）
	float SunLambda_calc(double in_modified_julian_date);
	



public:
	//-----------------------------------------
	// 衛星ソフトウェア依存変数宣言
	//-----------------------------------------

	// 主には出力ベクトル、配列を宣言

	//Magnaroでは、Mramへの値格納、読み出しのため、ROMに格納する初期値（プログラムベタ打ちの値（_あり配列））と
	//RAMに展開される実際の計算に使う値(_なし配列)の二つの値を宣言しておき、プログラム起動時に_あり配列から_なし配列にコピーする。
	//さらに、MRAMに格納した値を使用する場合は、MRAMの値を_なしの配列にコピーする。
	//メンバ定数にするにはstatic constが便利なので今回はこれを利用する

	 // 太陽方向計算用係数
	float SunCoef[18][3];
	static constexpr float SunCoef_[18][3] = {

    	    //二項以降
    	    {0.02,      355.05,     719.981},
    	    {0.0048,    234.95,     19.341},
    	    {0.002,     247.1,      329.64},
    	    {0.0018,    297.8,      4452.67},
    	    {0.0018,    251.3,      0.2},
    	    {0.0015,    343.2,      450.37},
    	    {0.0013,    81.4,       225.18},
    	    {0.0008,    132.5,      659.29},
    	    {0.0007,    153.3,      90.38},
    	    {0.0007,    206.8,      30.35},
    	    {0.0006,    29.8,       337.18},
    	    {0.0005,    207.4,      1.5},
    	    {0.0005,    291.2,      22.81},
    	    {0.0004,    234.9,      315.56},
    	    {0.0004,    157.3,      299.3},
    	    {0.0004,    21.1,       720.02},
    	    {0.0003,    352.5,      1079.97},
    	    {0.0003,    329.7,      44.43}

    };

	float SunVector_ICRF[3]; //[0]:x [1]:y [2]:z //名称はout_Vとすべきか？


	//-----------------------------------------
	// 衛星ソフトウェア依存関数宣言
	//-----------------------------------------
	void SunVector_calc(double in_modified_julian_date);
	
};


#endif /* C2A_AOCS_SUNVECTOR_H_ */
